<html>
<head>
	<title>Grundlegende Konzepte</title>
	
	<link rel="stylesheet" type="text/css" href="reference.css">
</head>
<body>

	<!-- navigation header start -->
	<table width="100%">
	   <tr>
	      <!-- back --><td width="50px"><a href="about_de.html">Zur&uuml;ck</a></td>
	      <!-- home --><td style="text-align:center;"><b>Grundlegende Konzepte</b></td>
	      <!-- next --><td width="50px;" style="text-align:right;"><a href="subscriptions_de.html">Vor</a></td>
	   </tr>
	</table>
	<hr />
	<!-- navigation header end -->

	<!-- content start --> 
	<p>
	Der folgende Abschnitt gibt einen &uuml;berblick &uuml;ber den technischen
	Jargon, der im Zusammenhang mit Feed Readern/News Aggregatoren 
	oft erw&auml;hnt wird und so sich auch in dieser Dokumentation und
	den verschiedenen Liferea-Men&uuml;s wiederfindet.
	</p>
	
	<h3>Was hei&szlig;t "Online/Offline Desktop" News Aggregator?</h3>
	<p>
	Feed Readers oder News Aggregatoren gibt es sowohl als Webanwendung
	als auch als lokale Desktopanwendung. Der Ort der Ausf&uuml;hrung der
	Anwendung (der lokale Rechner oder ein entfernter Webserver)
	bestimmt dabei verschiedene Vor- und Nachteile einer Online-
	bzw. Offline-L&ouml;sung.
	</p>
	
	<p>
	Ein <b>Desktop News Aggregator</b> l&auml;uft auf einem PC und speichert
	die aggregierten Feeds lokal. Zur Aktualisierung l&auml;dt er die Feeds
	periodisch aus dem Internet herunter. Wichtig ist, da&szlig; nicht alle
	Desktop News Aggregator offline arbeiten k&ouml;nnen. Einige Desktop
	Aggregatoren laden die Feeds bei jedem Betrachten aus dem Netz,
	ohne sie f&uuml;r ein sp&auml;teres Offline-Betrachten lokal zu speichern.
	Liferea hingegen ist ein <b>offline-f&auml;higer</b> Desktop Aggregator
	der die Feed-Inhalte lokal speichert und kann somit auch mit
	portablen Ger&auml;ten ohne permanente Internetanbindung (wie
	Laptops, Handhelds...) benutzt werden.
	</p>
	
	<ul>
	    <li><b>Nachteile:</b>
	         <ul>
		     <li>Keine implizite Synchronisation bei der Nutzung auf mehreren PCs.</li>
		     <li>H&ouml;here Bandbreitennutzung verglichen zu Online-Aggregatoren.</li>
		     <li>Mu&szlig; als Programm lokal installiert werden.</li>
		     <li>Abh&auml;ngig vom installierten Betriebssystem.</li>
		 </ul>
	    </li>
	    <li><b>Vorteile:</b>
	         <ul>
		     <li>Die Feed-Inhalte werden auf dem eigenen (sicheren) PC gespeichert.</li>
		     <li>Die Feed-Inhalte sind lokal mit diversen Tools durchsuchbar (z.B. <a href="http://beagle-project.org/Main_Page">Beagle</a>).</li>
		     <li>Die Liste der Abonnements ist nicht f&uuml;r Dritte (z.B. dem Anbieter des Online-Aggregator-Angebotes) einsehbar.</li>
		     <li>Jeder Zugriff auf die Feed-Inhalte bleibt privat.</li>
		 </ul>
	    </li>
	</ul>

	
	<p>
	Ein <b>Online News Aggregator</b> (wie zum Beispiel <a href="http://bloglines.com">Bloglines</a>)
	ist eine Anwendung auf einem entfernten Webserver auf die man
	praktisch von &uuml;berall zugreifen kann, solange ein Internetzugang
	verf&uuml;gbar ist. Nach dem Einloggen mu&szlig; der Online News Aggregator
	meist auch nicht erst die Feed-Inhalte von den verschiedenen
	Quellen herunterladen, sondern die Inhalte sind fast immer 
	bereits im Cache des Webservers und so wird Bandbreite gespart. 
	</p>
	
	<ul>
	    <li><b>Nachteile:</b>
	         <ul>
		     <li>Nutzer verlassen sich auf einen Dritten, n&auml;mlich dem Anbieter des Online News Aggregator Angebotes.</li>
		     <li>Oft mu&szlig; f&uuml;r fortgeschrittene Funktionen gezahlt werden.</li>
		     <li>Es gibt keine einfache M&ouml;glichkeit die Online-Applikation zu verbessern, zu korrigieren oder nach den eigenen Vorstellungen umzugestalten.</li>
		     <li>Zugriff nur &uuml;ber einen Webbrowser.</li>
		 </ul>
	    </li>
	    <li><b>Vorteile:</b>
	         <ul>
		     <li>Unabh&auml;ngig vom Zugriffsort erh&auml;lt man stets dieselbe Liste von Abonnements und der Lesezustand der Schlagzeilen bleibt erhalten.</li>
		     <li>Praktisch keine Bandbreitennutzung zum Herunterladen der Feed-Inhalte.</li>
		     <li>Community-Schlagzeilenbewertungssysteme die auch das Kategorisieren des Inhaltes erlauben.</li>
		     <li>Eigene Feed-Inhalte k&ouml;nnen f&uuml;r alle oder nur spezifische Nutzer des Online-Services freigegeben werden.</li>
		 </ul>
	    </li>
	</ul>
	
	<h3>Was ist eigentlich ein Feed?</h3>
	<p>
	F&uuml;r einen News Aggregator ist ein <i>News Feed</i> eine bestimmte
	Informationsquelle. Ein News Aggregator bezieht meist <i>Schlagzeilen</i>
	von einer Vielzahl von News Feed <i>Abonnements</i>. Der Begriff
	"News Feed" ist nicht sonderlich pr&auml;zise, da Feeds nicht nur News
	sondern auch Weblog-Postings, Podcasts und prinzipiell jeden
	Inhaltstyp anbieten k&ouml;nnen. &auml;hnliches gilt f&uuml;r den Begriff 
	"Schlagzeile": oft wird von "Artikeln" oder "Postings" gesprochen.
	Nichtsdestotrotz wird der Prefix "News" oft in Zusammenhang mit
	den Begriffen "Feed", "Schlagzeile" und "Aggregator" verwendet.
	</p>
	<p>
	F&uuml;gt man neue Abonnements zur Feed-Liste hinzu mu&szlig; die Quelle
	des Abonnements angegeben werden, damit der News Aggregator 
	das Feed initial herunterladen kann. Die Feed-Quelle ist meist
	eine HTTP URL. Beim Aktualisieren des Feeds l&auml;dt der News 
	Aggregator jeweils das unter dieser URL verf&uuml;gbar Dokument
	aus dem Netz. Es gibt verschiedene <a href="http://en.wikipedia.org/wiki/Extensible_Markup_Language">XML</a>-basierten und
	XML-&auml;hnliche Syndication-Standards (<a href="http://en.wikipedia.org/wiki/RSS_%28file_format%29">RSS</a>, <a href="http://en.wikipedia.org/wiki/Atom_%28standard%29">Atom</a>...), die definieren, wie ein Feed aussehen
	mu&szlig;, damit ein News Aggregator dessen Inhalte interpretieren kann.
	</p>
	<p>
	Nutzer eines News Aggregators m&uuml;ssen sich &uuml;blicherweise nicht mit
	diesen Syndication-Formaten auseinandersetzen. Es reicht aus, wenn
	sie die Feed-URL kennen um ein neues Abonnement anzulegen.
	</p>
	
	<h3>Was ist die sogenannte Feed-Liste?</h3>
	<p>
	Typische News Aggregators verwalten die Feed-Abonnements in
	einer Baumstruktur: der <i>Feed-Liste</i>. &auml;hnlich dem typischen 
	Layout von Email-Clients wird die Feed-Liste meist auf der
	linken Seite des Fensters dargestellt.
	</p>
	<p>
	Manche Aggregator, unter anderem Liferea, erlauben die Feed-Liste
	hierarchisch zu gliedern um z.B. Feed-Kategorien abzubilden, 
	andere nicht.
	</p>
	
	<h3>Was ist eine Schlagzeile?</h3>
	<p>
	Um ein Abonnement zu aktualisieren l&auml;dt ein News Aggregator
	das Quelldokument des Feeds aus dem Netz herunter. Dieses Dokument
	enth&auml;lt eine Menge der neuesten <i>Schlagzeilen</i>, die von dem
	Feed angeboten werden, und der News Aggregator pflegt diese nun
	in die lokal gesicherten Feed-Inhalte ein.
	</p>
	<p>
	Von einem Feed angebotenen Schlagzeilen sind die kleinste 
	Informationseinheit mit der ein News Aggregator arbeitet.
	</p>
	
	<h3>Was ist die Schlagzeilenliste?</h3>
	<p>
	In Liferea werden die Schlagzeilen in der sogenannten
	<i>Schlagzeilenlist</i> angezeigt. Analog vielen Email-Clients
	wird die Liste der Schlagzeilen im oberen rechten Bereich des
	Fensters angezeigt.
	</p>
	
	<!-- content end --> 

	<!-- navigation footer start -->
	<hr />
	<table width="100%">
	   <tr>
	      <!-- back --><td width="50px"><a href="about_de.html">Zur&uuml;ck</a></td>
	      <!-- home --><td style="text-align:center;"><a href="topics_de.html">Inhalt</a></td>
	      <!-- next --><td width="50px;" style="text-align:right;"><a href="subscriptions_de.html">Vor</a></td>
	   </tr>
	</table>
	<!-- navigation footer end -->
</body>
</html>

