<html>
<head>
	<title>Enclosures/Podcasting</title>
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />	
	<link rel="stylesheet" type="text/css" href="help.css">
</head>
<body>

	<!-- navigation header start -->
	<table width="100%">
	   <tr>
	      <!-- back --><td width="50px"><a href="searching_de.html">Zur&uuml;ck</a></td>
	      <!-- home --><td style="text-align:center;"><b>Enclosures/Podcasting</b></td>
	      <!-- next --><td width="50px;" style="text-align:right;"><a href="newsbin_de.html">Vor</a></td>
	   </tr>
	</table>
	<hr />
	<!-- navigation header end -->

	<h3>Enclosures/Podcasting</h3>

	<h4>Worum geht es hier eigentlich?</h4>
	
	<p>
	Viele Weblogs und News Feeds wollen mehr als nur ASCII oder HTML
	formatierte Artikel bieten. Ein Weblog-Autor m&ouml;chte zum Beispiel
	seine t&auml;glichen Erlebnisse aufnehmen und als Audio Daten (meist MP3) 
	im Weblog und dem zugeh&ouml;rigen News Feed den Lesern anbieten. 
	Das erm&ouml;glichen sogenannte <b>Enclosures</b>. Ein Enclosure an
	einer Schlagzeile hinzuzuf&uuml;gen bedeutet der Schlagzeile eine
	URL beizugeben, die eine Applikation wie Liferea herunterladen
	und mit einem passendem Medienplayer abspielen kann.
	</p>
	
	<p>
	Feeds mit Audioinhalten werden oft als <b>Podcasts</b> bezeichnet.
	Das Publizieren solchen Inhalts wird <b>Podcasting</b> genannt.
	Die Wikipedia Seite &uuml;ber <a href="http://en.wikipedia.org/wiki/Podcasting">Podcasting</a> ist ein guter Startpunkt um mehr dar&uuml;ber
	zu erfahren.
	</p>

	<p>
	Das Anbieten von Audioinhalten ist zwar am weitesten verbreitet 
	aber es sind auch Feeds denkbar die Bilder, Torrents oder
	Videos einbinden. Praktisch jedes Datenformat ist m&ouml;glich.
	</p>

	<h4>Wie Liferea Enclosures herunterl&auml;dt</h4>

	<p>
	Standardm&auml;&szlig;ig l&auml;dt Liferea Enclosures nicht automatisch herunter.
	Es ist jedoch m&ouml;glich f&uuml;r jedes Feed einzeln das automatische
	Herunterladen zu aktivieren. Wird ein neues Enclosure erkannt
	startet Liferea den Download mit dem in den Einstellungen
	<a href="preferences_de.html#enclosures">konfigurierten Download Tool</a>. Alle
	heruntergeladenen Dateien werden im ebenfalls in den Einstellungen
	<a href="preferences_de.html#enclosures">konfigurierbaren
	Download-Verzeichnis</a> abgelegt. Heruntergeladene Dateien
	werden nach dem Abspielen nicht automatisch gel&ouml;scht!
	</p>

	<p>Nat&uuml;rlich k&ouml;nnen die Enclosures auch <b>manuell 
	heruntergeladen</b> werden. Dazu w&auml;hlt man die entsprechende
	Schlagzeilen aus und klickt den Pfeil links des Enclosures
	an um dessen Kontextmen&uuml; zu &ouml;ffnen. Dieses bietet zwei Men&uuml;punkte.
	Der erste l&auml;dt das Enclosure herunter und l&auml;dt es mit dem
	entsprechenden Medienplayer. Mit dem zweiten Men&uuml;punkt kann die
	Datei einfach nur in ein angegebenes Verzeichnis gesichert werden.
	</p>

	<h4>Wie Liferea Enclosures abspielt</h4>

	<p>
	Nach dem Herunterladen eines Enclosures versucht Liferea
	dieses entsprechend des MIME Typs oder der Dateiendung
	zu &ouml;ffnen. Die Anwendung zum Anzeigen oder Abspielen der
	heruntergeladenen Datei kann in den <a href="preferences_de.html#enclosures">Einstellungen konfiguriert werden</a>.
	Hinweis: Es h&auml;ngt vom Feed ab ob der MIME Typ f&uuml;r das
	Starten des konfigurierten Abspielprogrammes verf&uuml;gbar ist
	oder nur die Dateiendung verwendet werden kann.
	</p>
	
	<!-- navigation footer start -->
	<hr />
	<table width="100%">
	   <tr>
	      <!-- back --><td width="50px"><a href="searching_de.html">Zur&uuml;ck</a></td>
	      <!-- home --><td style="text-align:center;"><a href="topics_de.html">Inhalt</a></td>
	      <!-- next --><td width="50px;" style="text-align:right;"><a hef="newsbin_de.html">Vor</a></td>
	   </tr>
	</table>
	<!-- navigation footer end -->
</body>
</html>
