<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
   "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
	<title>Abonnements verwalten</title>
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
	<link rel="stylesheet" type="text/css" href="reference.css" >
</head>
<body>


	<!-- navigation header start -->
	<table width="100%">
	   <tr>
	      <!-- back --><td width="50px"><a href="concepts_de.html">Zur&uuml;ck</a></td>
	      <!-- home --><td style="text-align:center;"><b>Abonnements verwalten</b></td>
	      <!-- next --><td width="50px;" style="text-align:right;"><a href="headlines_de.html">Vor</a></td>
	   </tr>
	</table>
	<hr />
	<!-- navigation header end -->

	<!-- content start --> 
	<h3>Abonnements anlegen</h3>
	<p>
	Mit dem Men&uuml;punkt "Neues Abonnement" aus dem Hauptmen&uuml; oder
	dem Kontextmen&uuml; der Liste der Abonnements kann ein Dialog
	zum Anlegen eines neuen Abonnements ge&ouml;ffnet werden.
	</p>	

	<p align="center">
	<img src="help_subscribe_1.4.0.png">
	</p>

	<p>
	Um zum Beispiel Slashdot's RSS News Feed zu abonnieren
	ist einfach die Feed-URL
	"<i><a href="http://slashdot.org/index.rss">http://slashdot.org/index.rss</a></i>"
	anzugeben. Ist die Feed-URL nicht bekannt kann auch
	nur die Webseite (z.B. http://slashdot.org) angegeben
	werden und Liferea versucht die Feed-URL automatisch
	zu bestimmen.</p>

	<h3>Spezielle Abonnements anlegen</h3>

	<p>
	Neben dem Abonnement von einfach Feed URLs unterst&uuml;tzt Liferea
	auch das Abonnieren von Unix-Kommandos, die ein Feed zur&uuml;ckliefern,
	oder von Dateien die Feeds enthalten. Zus&auml;tzlich k&ouml;nnen Filter
	(sowohl XSLT Stylesheets als auch Kommandozeilenaufrufe) f&uuml;r
	Abonnements konfiguriert werden. Dieser zus&auml;tzlichen Einstellungen
	k&ouml;nnen im erweiterten Dialog eingestellt werden. Dieser kann
	durch das Anklicken von "Erweitert" im einfachen Abonnieren-Dialog
	aktiviert werden.
	</p>
	
	<p align="center">
	<img src="help_subscribe_adv_1.4.0.png">
	</p>
	
	<p>Im Falle von Kommandos und Dateien als Quelltyp k&ouml;nnen diese 
	mit Hilfe eines Dateiausw&auml;hldialoges mit "Datei ausw&auml;hlen..."
	gesucht werden.</p>
	
	<p>Es kann vorkommen, da&szlig; ein Feed-Format von Liferea nicht
	unterst&uuml;tzt wird. In diesem Fall kann ein Konvertierungsfilter
	verwendet werden um die Daten in ein f&uuml;r Liferea lesbares
	Format zu &uuml;berf&uuml;hren. Solche Filter k&ouml;nnen zum Beispiel aus dem
	<a href="http://home.kcore.de/~kiza/software/snownews/snowscripts/">Snownews und Liferea Skript-Repository</a> (Englisch)
	heruntergeladen werden.</p>

	<p>Um solche Konvertierungsfilter zu benutzen mu&szlig; die Option
	"Benutze Filter zum Konvertieren" aktiviert werden. Der Pfad
	des Filter-Skriptes mu&szlig; dann unter "Konvertiere mit" angegeben
	werden. Alternativ kann das Skript mit "Datei ausw&auml;hlen..."
	gesucht werden. Ein Filter ist ein einfaches Programm welches
	die Quelldaten von stdin einliest und in einem von Liferea
	unterst&uuml;tzten Format auf stdout wieder ausgibt. Solche Filter
	k&ouml;nnen z.B. mit Perl leicht geschrieben werden. </p>
	
	<h3>Abonnement-Eigenschaften</h3>

	<p>Der Eigenschaften-Dialog f&uuml;r ein Abonnement wird nach dem
	Anlegen neuer Abonnements automatisch ge&ouml;ffnet. Zus&auml;tzlich 
	kann er mit dem Men&uuml;punkt "Eigenschaften" aus dem Hauptmen&uuml;
	oder dem Kontextmen&uuml; eines ausgew&auml;hlten Abonnements aufgerufen
	werden.	Beim Erzeugen neuer Abonnements ist es oft gar nicht
	notwendig die Defaultwerte zu ver&auml;ndern und es reicht aus
	den Dialog mit dem "Ok" Button zu best&auml;tigen.
	</p>
	
	<p>
	Der Eigenschaften-Dialog ist in f&uuml;nf Registerkarten unterteilt:
	"Allgemein", "Quelle", "Archiv", "Download" und	"Advanced":</p>

	<h4>Allgemeine Eigenschaften</h4>

	<p align="center">
	<img src="help_feed_prop_general_1.4.0.png"/>
	</p>
	
	<p>Die Registerkarte "Allgemein" erlaubt das &Auml;ndern des 
	Titels und des Aktualisierungsintervalls des Abonnements.
	</p>
	
	<a name="updateInterval">
	<div id="updateInterval"><p>Das Aktualisierungsintervall
		kontrolliert nach welcher Zeit Liferea ein Abonnement
		aktualisiert. Meistens ist es nicht n&ouml;tig die
		Defaulteinstellung zu &auml;ndern. Es wird empfohlen das
		globale Aktualisierungsintervall zu benutzen, welches
		in den Programmeinstellungen festgelegt wird. Auf diese
		Weise kann die Aktualisierung aller Abonnements zentral
		gesteuert werden.</p>
	  
	  <p>Manchmal geben Feeds ein eigenes Aktualisierungsintervall
		vor. In diesem Fall wird Liferea automatisch die
		Option "Benutzerdefinierte Aktualisierung" ausw&auml;hlen
		und das vom Feed vorgeschlagene Intervall eintragen.
		Dies passiert nur beim Anlegen neuer Abonnements
		Gibt ein Feed ein eigenes Interval vor sollte dieses
		auch beibehalten werden.</p>

		<p>Es gibt folgende Modi f&uuml;r das Aktualisierungsinterval</p>
		<dl>
		  <dt>Nutze das globale Aktualisierungsintervall</dt>
		  <dd>Mit dieser Option wird das Aktualisierungsintervall
			durch die globale Programmeinstellung festgelegt.
			</dd>
		  
		  <dt>Benutzerdefinierte Aktualisierung</dt>
		  <dd>Mit dieser Option kann ein beliebiges
			Aktualisierungsintervall f&uuml;r das Abonnement
			vorgegeben werden.
			<em>Beim Angeben des Intervalls sollte man sich
			immer bewu&szlig;t sein, welchen Datenverkehr man mit
			unpassenden Werten verursachen kann. Ein Abonnement
			sollte nie &ouml;fter aktualisiert werden als sich 
			seine angebotenen Inhalte &auml;ndern.</em></dd>
	
		  <dt>Feed nicht automatisch aktualisieren</dt>
		  <dd>Mit dieser Option kann das Aktualisieren des
			Abonnements deaktiviert werden. Das ist n&uuml;tzlich
			f&uuml;r Abonnements die man nur manuell aktualisieren
			m&ouml;chte.</dd>
	  </dl>
	</div>

	<h4>Quelle des Abonnements</h4>

	<p align="center">
	<img src="help_feed_prop_source_1.4.0.png"/>
	</p>
	
	<p>Die Registerkarte "Quelle" enth&auml;lt dieselben Dialogelemente
	die auch beim Anlegen neuer Abonnements angeboten werden. Daher
	kann hier die Quelle des Abonnements nachtr&auml;glich ver&auml;ndert
	werden (z.B. wenn sich die URL der Webseite &auml;ndert)</p>

	<h2>Archiv-Eigenschaften</h2>

	<p align="center">
	<img src="help_feed_prop_cache_1.4.0.png"/>
	</p>
	
	<p>Die dritte Registerkarte, "Archiv", erlaubt es die
	Anzahl zu sichernder Schlagzeilen zu konfigurieren.
	Diese Einstellungen sind analog zu den globalen 
	Cache-Einstellungen. Normalerweise ist es ausreichend
	die globale Einstellung zu verwenden.</p>
	
	<dl>
	  <dt>Default-Cache-Einstellungen</dt>
	  <dd>F&uuml;r das Abonnement soll die globale Cache-Einstellung
		verwendet werden.</dd>
	  <dt>Cache Deaktivieren</dt>
	  <dd>Verhindert das Sichern der Schlagzeilen.</dd>
	  <dt>Unbeschr&auml;nkter Cache</dt>
	  <dd>Sichert alle Schlagzeilen. Verwirft niemals 
		eine Schlagzeile.</dd>
	  <dt>Cache begrenzen auf # Schlagzeilen</dt>
	  <dd>Sichert nur # Schlagzeilen. Verwirft alte Schlagzeilen
		sobald mehr als # Schlagzeilen vorhanden sind.</dd>
	</dl>

	<p>
	<strong>Hinweis:</strong> Markierte Schlagzeilen werden 
	unabh&auml;ngig von den Cache-Einstellungen niemals gel&ouml;scht.
	Durch das Setzen der Flagge einer Schlagzeile die man gerade
	gelesen hat verhindert man deren zuk&uuml;nftiges L&ouml;schen.
	</p>
	
	<h4>Download Einstellungen</h4>
	
	<p align="center">
	<img src="help_feed_prop_auth_1.4.0.png"/>
	</p>
	
	<p>
	Mit dieser Registerkarte kann die HTTP Authentifikation f&uuml;r
	den Download der Abonnement-Quelle aktiviert werden. Nach dem
	aktivieren der Checkbox k&ouml;nnen Benutzername und Pa&szlig;wort eingegeben
	werden. &uuml;blicherweise ist es nicht notwendig die 
	Authentifikationsdaten im Voraus anzugeben, da Liferea automatisch
	nachfragt sobald eine Abonnement-Quelle Authentifikation erfordert.
	</p>
	
	<h4>Advanced Einstellungen</h4>
	
	<p align="center">
	<img src="help_feed_prop_adv_1.4.0.png"/>
	</p>

	<p>
	In dieser Registerkarte kann der <a href="enclosures_de.html">automatische Download f&uuml;r Anh&auml;nge</a> 
	f&uuml;r dieses Abonnement aktiviert werden.
	</p>

	<p>
	Die zweite Checkbox erlaubt es das Verhalten beim Ausw&auml;hlen
	einer Schlagzeile zu &auml;ndern. Per-default wird der Inhalt der
	Schlagzeile angezeigt. Wird diese Option aktiviert, dann wird
	beim Ausw&auml;hlen automatisch der Link im internen Browser geladen.
	</p>

	<h3>Abonnieren von OPML-Quellen, Bloglines- und Google Reader-Accounts</h3>
	<p>
	OPML-Quellen bieten Feedlisten an, die man in den News Aggregator 
	einbinde kann. Um einen OPML-Quelle, einen Bloglines- oder Google Reader-Account
	zu abonnieren mu&szlig; "Neue Quelle" aus dem Kontextmen&uuml; der Feedliste oder
	dem "Abonnements" Men&uuml; ausgew&auml;hlt werden. Aus dem folgenden Dialog kann
	der Typ der hinzuzuf&uuml;genden Quelle ausgew&auml;hlt werden.
	</p>

	<p align="center">
	<img src="help_source_add_1.4.0.png"/>
	</p>
	
	<h4>OPML-Quellen</h4>
	<p>
	Soll eine neue OPML-Quelle ("Planet/BlogRoll/OPML") angelegt werden
	mu&szlig; die Quell-URL dieser angegeben werden. Oft m&uuml;ssen zus&auml;tzlich nach
	der ersten Download noch Username und Pa&szlig;wort angegeben werden.
	Nach erfolgreicher Abonnierung der OPML-Quelle wird deren Feedliste
	als Teilbaum in die Feedliste von Liferea eingef&uuml;gt. &Auml;ndert sich
	die OPML-Quelle sp&auml;ter pa&szlig;t Liferea den Teilbaum entsprechend an
	und f&uuml;gt neue Abonnements automatisch hinzu und entfernt alte
	Abonnements entsprechend.
	</p>
	
	<h4>Bloglines</h4>
	<p>
	Soll ein "Bloglines" Account abonniert werden m&uuml;ssen Bloglines Username
	und Pa&szlig;wort angegeben werden. &Auml;hnlich wie bei OPML-Quellen l&auml;dt Liferea
	die Bloglines Abonnements und f&uuml;gt sie automatisch der Feedliste hinzu.
	<br /><br />
	<b>Wichtig: Liferea synchronisiert nur die Liste der Bloglines 
	Abonnements, nicht aber die Lesezust&auml;nde der verschiedenen Feeds!</b>
	</p>
	
	<h4>Google Reader</h4>
	<p>
	Soll ein "Google Reader" Account abonnniert werden m&uuml;ssen Google Reader
	Username und Pa&szlig;wort angegeben werden. Wie bei Bloglines und OPML-Quellen
	f&uuml;gt Liferea automatisch die Google Reader Abonnements der Feedliste
	hinzu und aktualisiert sie regelm&auml;&szlig;ig.
	<br /><br />
	<b>Wichtig: Liferea synchronisiert nur die Liste der Google Reader
	Abonnements, nicht aber die Lesezust&auml;nde der verschiedenen Feeds!</b>	
	</p>
	
	<!-- navigation footer start -->
	<hr />
	<table width="100%">
	   <tr>
	      <!-- back --><td width="50px"><a href="concepts_de.html">Zur&uuml;ck</a></td>
	      <!-- home --><td style="text-align:center;"><a href="topics_de.html">Inhalt</a></td>
	      <!-- next --><td width="50px;" style="text-align:right;"><a href="headlines_de.html">Vor</a></td>
	   </tr>
	</table>
	<!-- navigation footer end -->
</body>
</html>
